u-blox/cellular/port/platform/stm/stm32f4_mynewt/src/cellular_port_uart.c
#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(1, 5)
void DMA1_Stream5_IRQHandler()
{
    dmaIrqHandler(1, 5);
}
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(1, 6)
void DMA1_Stream6_IRQHandler()
{
    dmaIrqHandler(1, 6);
}
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(1, 7)
void DMA1_Stream7_IRQHandler()
{
    dmaIrqHandler(1, 7);
}
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 0)
void DMA2_Stream0_IRQHandler()
{
    dmaIrqHandler(2, 0);
}
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 1)
void DMA2_Stream1_IRQHandler()
{
    dmaIrqHandler(2, 1);
}
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 2)
void DMA2_Stream2_IRQHandler()
{
    dmaIrqHandler(2, 2);
}
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 3)
void DMA2_Stream3_IRQHandler()
{
    dmaIrqHandler(2, 3);
}
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 4)
void DMA2_Stream4_IRQHandler()
{
    dmaIrqHandler(2, 4);
}
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 5)
void DMA2_Stream5_IRQHandler()
{
    dmaIrqHandler(2, 5);
}
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 6)
void DMA2_Stream6_IRQHandler()
{
    dmaIrqHandler(2, 6);
}
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 7)
void DMA2_Stream7_IRQHandler()
{
    dmaIrqHandler(2, 7);
}
#endif

static void
cellular_port_uart_set_vectors(void)
{
#if CELLULAR_CFG_UART1_AVAILABLE
    NVIC_SetVector(USART1_IRQn, (uint32_t)USART1_IRQHandler);
#endif

#if CELLULAR_CFG_UART2_AVAILABLE
    NVIC_SetVector(USART2_IRQn, (uint32_t)USART2_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(1, 0)
    NVIC_SetVector(DMA1_Stream0_IRQn, (uint32_t)DMA1_Stream0_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(1, 1)
    NVIC_SetVector(DMA1_Stream1_IRQn, (uint32_t)DMA1_Stream1_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(1, 2)
    NVIC_SetVector(DMA1_Stream2_IRQn, (uint32_t)DMA1_Stream2_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(1, 3)
    NVIC_SetVector(DMA1_Stream3_IRQn, (uint32_t)DMA1_Stream3_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(1, 4)
    NVIC_SetVector(DMA1_Stream4_IRQn, (uint32_t)DMA1_Stream4_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(1, 5)
    NVIC_SetVector(DMA1_Stream5_IRQn, (uint32_t)DMA1_Stream5_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(1, 6)
    NVIC_SetVector(DMA1_Stream6_IRQn, (uint32_t)DMA1_Stream6_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(1, 7)
    NVIC_SetVector(DMA1_Stream7_IRQn, (uint32_t)DMA1_Stream7_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 0)
    NVIC_SetVector(DMA2_Stream0_IRQn, (uint32_t)DMA2_Stream0_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 1)
    NVIC_SetVector(DMA2_Stream1_IRQn, (uint32_t)DMA2_Stream1_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 2)
    NVIC_SetVector(DMA2_Stream2_IRQn, (uint32_t)DMA2_Stream2_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 3)
    NVIC_SetVector(DMA2_Stream3_IRQn, (uint32_t)DMA2_Stream3_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 4)
    NVIC_SetVector(DMA2_Stream4_IRQn, (uint32_t)DMA2_Stream4_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 5)
    NVIC_SetVector(DMA2_Stream5_IRQn, (uint32_t)DMA2_Stream5_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 6)
    NVIC_SetVector(DMA2_Stream6_IRQn, (uint32_t)DMA2_Stream6_IRQHandler);
#endif

#if CELLULAR_PORT_DMA_INTERRUPT_IN_USE(2, 7)
    NVIC_SetVector(DMA2_Stream7_IRQn, (uint32_t)DMA2_Stream7_IRQHandler);
#endif
}

/* ----------------------------------------------------------------
 * PUBLIC FUNCTIONS
 * -------------------------------------------------------------- */

// Initialise a UART.
int32_t cellularPortUartInit(int32_t pinTx, int32_t pinRx,
                             int32_t pinCts, int32_t pinRts,
                             int32_t baudRate,
                             size_t rtsThreshold,
                             int32_t uart,
                             CellularPortQueueHandle_t *pUartQueue)
{
    CellularPortErrorCode_t errorCode = CELLULAR_PORT_INVALID_PARAMETER;
    ErrorStatus platformError;
    CellularPortUartData_t uartData = {0};
    LL_USART_InitTypeDef usartInitStruct = {0};
    LL_GPIO_InitTypeDef gpioInitStruct = {0};
    USART_TypeDef *pUartReg;
    uint32_t dmaEngine;
    DMA_TypeDef *pDmaReg;
    uint32_t dmaStream;
    uint32_t dmaChannel;
    IRQn_Type uartIrq;
    IRQn_Type dmaIrq;

    // TODO: use this
    (void) rtsThreshold;

    /* XXX: ugly, but just do this for now */
    cellular_port_uart_set_vectors();

    if ((pUartQueue != NULL) && (pinRx >= 0) && (pinTx >= 0) &&
        (uart > 0) && (uart <= CELLULAR_PORT_MAX_NUM_UARTS) &&
        (baudRate >= 0)) {
        errorCode = CELLULAR_PORT_SUCCESS;
        if (pGetUart(uart) == NULL) {
            // Create the mutex
            errorCode = cellularPortMutexCreate(&(uartData.mutex));
            if (errorCode == 0) {

                CELLULAR_PORT_MUTEX_LOCK(uartData.mutex);

                errorCode = CELLULAR_PORT_OUT_OF_MEMORY;
                uartData.number = uart;
                // Malloc memory for the read buffer
                uartData.pRxBufferStart = (char *) pCellularPort_malloc(CELLULAR_PORT_UART_RX_BUFFER_SIZE);
                if (uartData.pRxBufferStart != NULL) {
                    uartData.pConstData = &(gUartCfg[uart]);
                    uartData.pRxBufferRead = uartData.pRxBufferStart;
                    uartData.pRxBufferWrite = uartData.pRxBufferStart;
                    uartData.userNeedsNotify = true;

                    // Create the queue
                    errorCode = cellularPortQueueCreate(CELLULAR_PORT_UART_EVENT_QUEUE_SIZE,
                                                        sizeof(CellularPortUartEventData_t),
                                                        pUartQueue);
                    if (errorCode == 0) {
                        uartData.queue = *pUartQueue;

                        pUartReg = gUartCfg[uart].pReg;
                        dmaEngine = gUartCfg[uart].dmaEngine;
                        pDmaReg = gpDmaReg[dmaEngine];
                        dmaStream = gUartCfg[uart].dmaStream;
                        dmaChannel = gUartCfg[uart].dmaChannel;
                        uartIrq = gUartCfg[uart].irq;
                        dmaIrq = gpDmaStreamIrq[dmaEngine][dmaStream];

