u-blox/cellular/port/platform/stm/stm32f4_mynewt/src/cellular_port_uart.c
                        // Now do the platform stuff
                        errorCode = CELLULAR_PORT_PLATFORM_ERROR;

                        // Enable clock to the UART/USART HW block
                        gLlApbClkEnable[uart](gLlApbGrpPeriphUart[uart]);

                        // Enable clock to the DMA HW block (all DMAs
                        // are on bus 1)
                        LL_AHB1_GRP1_EnableClock(gLlApbGrpPeriphDma[dmaEngine]);

                        // Configure the GPIOs
                        // Note, using the LL driver rather than our
                        // driver or the HAL driver here partly because
                        // the example code does that and also
                        // because we need to enable the alternate
                        // function for these pins.

                        // Enable clock to the registers for the Tx/Rx pins
                        cellularPortPrivateGpioEnableClock(pinTx);
                        cellularPortPrivateGpioEnableClock(pinRx);
                        // The Pin field is a bitmap so we can do Tx and Rx
                        // at the same time as they are always on the same port
                        gpioInitStruct.Pin = (1U << CELLULAR_PORT_STM32F4_GPIO_PIN(pinTx)) |
                                             (1U << CELLULAR_PORT_STM32F4_GPIO_PIN(pinRx));
                        gpioInitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
                        gpioInitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
                        // Output type doesn't matter, it is overridden by
                        // the alternate function
                        gpioInitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
                        gpioInitStruct.Pull = LL_GPIO_PULL_UP;
                        gpioInitStruct.Alternate = gGpioAf[uart];
                        platformError = LL_GPIO_Init(pCellularPortPrivateGpioGetReg(pinTx),
                                                     &gpioInitStruct);

                        //  Configure RTS if present
                        if ((pinRts >= 0) && (platformError == SUCCESS)) {
                            cellularPortPrivateGpioEnableClock(pinRts);
                            gpioInitStruct.Pin = 1U << CELLULAR_PORT_STM32F4_GPIO_PIN(pinRts);
                            platformError = LL_GPIO_Init(pCellularPortPrivateGpioGetReg(pinRts),
                                                         &gpioInitStruct);
                        }

                        //  Configure CTS if present
                        if ((pinCts >= 0) && (platformError == SUCCESS)) {
                            cellularPortPrivateGpioEnableClock(pinCts);
                            gpioInitStruct.Pin = 1U << CELLULAR_PORT_STM32F4_GPIO_PIN(pinCts);
                            // TODO: the u-blox C030-R412M board requires a pull-down here
                            gpioInitStruct.Pull = LL_GPIO_PULL_DOWN;
                            platformError = LL_GPIO_Init(pCellularPortPrivateGpioGetReg(pinCts),
                                                         &gpioInitStruct);
                        }

                        // Configure DMA
                        if (platformError == SUCCESS) {
                            // Set the channel on our DMA/Stream
                            LL_DMA_SetChannelSelection(pDmaReg, dmaStream,
                                                       gLlDmaChannel[dmaChannel]);
                            // Towards RAM
                            LL_DMA_SetDataTransferDirection(pDmaReg, dmaStream,
                                                            LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
                            // Low priority
                            LL_DMA_SetStreamPriorityLevel(pDmaReg, dmaStream,
                                                          LL_DMA_PRIORITY_LOW);
                            // Circular
                            LL_DMA_SetMode(pDmaReg, dmaStream, LL_DMA_MODE_CIRCULAR);
                            // Byte-wise transfers from a fixed
                            // register in a peripheral to an
                            // incrementing location in memory
                            LL_DMA_SetPeriphIncMode(pDmaReg, dmaStream,
                                                    LL_DMA_PERIPH_NOINCREMENT);
                            LL_DMA_SetMemoryIncMode(pDmaReg, dmaStream,
                                                    LL_DMA_MEMORY_INCREMENT);
                            LL_DMA_SetPeriphSize(pDmaReg, dmaStream,
                                                 LL_DMA_PDATAALIGN_BYTE);
                            LL_DMA_SetMemorySize(pDmaReg, dmaStream,
                                                 LL_DMA_MDATAALIGN_BYTE);
                            // Not FIFO mode, whatever that is
                            LL_DMA_DisableFifoMode(pDmaReg, dmaStream);

                            // Attach the DMA to the UART at one end
                            LL_DMA_SetPeriphAddress(pDmaReg, dmaStream,
                                                    (uint32_t) &(pUartReg->DR));

                            // ...and to the RAM buffer at the other end
                            LL_DMA_SetMemoryAddress(pDmaReg, dmaStream,
                                                    (uint32_t) (uartData.pRxBufferStart));
                            LL_DMA_SetDataLength(pDmaReg, dmaStream,
                                                 CELLULAR_PORT_UART_RX_BUFFER_SIZE);

                            // Clear all the DMA flags and the DMA pending IRQ from any previous
                            // session first, or an unexpected interrupt may result
                            gpLlDmaClearFlagHt[dmaStream](pDmaReg);
                            gpLlDmaClearFlagTc[dmaStream](pDmaReg);
                            gpLlDmaClearFlagTe[dmaStream](pDmaReg);
                            gpLlDmaClearFlagDme[dmaStream](pDmaReg);
                            gpLlDmaClearFlagFe[dmaStream](pDmaReg);
                            NVIC_ClearPendingIRQ(dmaIrq);

                            // Enable half full and transmit complete DMA interrupts
                            LL_DMA_EnableIT_HT(pDmaReg, dmaStream);
                            LL_DMA_EnableIT_TC(pDmaReg, dmaStream);

                            // Set DMA priority
                            NVIC_SetPriority(dmaIrq,
                                             NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 5, 0));

