u-blox/cellular/port/platform/stm/stm32f4_mynewt/src/cellular_port_uart.c
                            // Go!
                            NVIC_EnableIRQ(dmaIrq);

                            // Initialise the UART/USART
                            usartInitStruct.BaudRate = baudRate;
                            usartInitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
                            usartInitStruct.StopBits = LL_USART_STOPBITS_1;
                            usartInitStruct.Parity = LL_USART_PARITY_NONE;
                            // Both transmit and received enabled
                            usartInitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
                            // TODO: need to connect flow control to DMA?
                            usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
/* WWW */
#if 1
                            if ((pinRts >= 0) && (pinCts >= 0)) {
                                usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_RTS_CTS;
                            } else {
                                if (pinRts >= 0) {
                                    usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_RTS;
                                } else {
                                    usartInitStruct.HardwareFlowControl = LL_USART_HWCONTROL_CTS;
                                }
                            }
#endif
/* WWW */
                            usartInitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
                            platformError = LL_USART_Init(pUartReg, &usartInitStruct);
                        }

                        // Connect it all together
                        if (platformError == SUCCESS) {
                            // Asynchronous UART/USART with DMA on the receive
                            // and include only the idle line interrupt,
                            // DMA does the rest
                            LL_USART_ConfigAsyncMode(pUartReg);
                            LL_USART_EnableDMAReq_RX(pUartReg);
                            LL_USART_EnableIT_IDLE(pUartReg);

                            // Enable the UART/USART interrupt
                            NVIC_SetPriority(uartIrq,
                                             NVIC_EncodePriority(NVIC_GetPriorityGrouping(),
                                                                 5, 1));
                            LL_USART_ClearFlag_IDLE(pUartReg);
                            NVIC_ClearPendingIRQ(uartIrq);
                            NVIC_EnableIRQ(uartIrq);

                            // Enable DMA and UART/USART
                            LL_DMA_EnableStream(pDmaReg, dmaStream);
                            LL_USART_Enable(pUartReg);
                        }

                        // Finally, add the UART to the list
                        if (platformError == SUCCESS) {
                            errorCode = CELLULAR_PORT_OUT_OF_MEMORY;
                            if (pAddUart(uart, &uartData) != NULL) {
                                errorCode = CELLULAR_PORT_SUCCESS;
                            }
                        }
                    }
                }

                CELLULAR_PORT_MUTEX_UNLOCK(uartData.mutex);

                // If we failed, clean up
                if (errorCode != 0) {
                    cellularPortMutexDelete(uartData.mutex);
                    cellularPort_free(uartData.pRxBufferStart);
                }
            }
        }
    }

    return (int32_t) errorCode;
}

// Shutdown a UART.
int32_t cellularPortUartDeinit(int32_t uart)
{
    CellularPortErrorCode_t errorCode = CELLULAR_PORT_INVALID_PARAMETER;
    CellularPortUartData_t *pUartData;
    USART_TypeDef *pUartReg;
    uint32_t dmaEngine;
    uint32_t dmaStream;

    if ((uart > 0) && (uart <= CELLULAR_PORT_MAX_NUM_UARTS)) {
        pUartData = pGetUart(uart);
        errorCode = CELLULAR_PORT_SUCCESS;
        if (pUartData != NULL) {

            pUartReg = gUartCfg[uart].pReg;
            dmaEngine = gUartCfg[uart].dmaEngine;
            dmaStream = gUartCfg[uart].dmaStream;
            // No need to lock the mutex, we need to delete it
            // and we're not allowed to delete a locked mutex.
            // The caller needs to make sure that no read/write
            // is in progress when this function is called.

            // TODO check this

            // Disable DMA and UART/USART interrupts
            NVIC_DisableIRQ(gpDmaStreamIrq[dmaEngine][dmaStream]);
            NVIC_DisableIRQ(gUartCfg[uart].irq);

            // Disable DMA and USART, waiting for DMA to be
            // disabled first according to the note in
            // section 10.3.17 of ST's RM0090.
            LL_DMA_DisableStream(gpDmaReg[dmaEngine], dmaStream);
            while (LL_DMA_IsEnabledStream(gpDmaReg[dmaEngine], dmaStream)) {}
            LL_USART_Disable(pUartReg);
            LL_USART_DeInit(pUartReg);

            // Delete the queue
            cellularPortQueueDelete(pUartData->queue);
            // Free the buffer
            cellularPort_free(pUartData->pRxBufferStart);
            // Delete the mutex
            cellularPortMutexDelete(pUartData->mutex);
            // And finally remove the UART from the list
            removeUart(uart);
            errorCode = CELLULAR_PORT_SUCCESS;
        }
    }

    return (int32_t) errorCode;
}

// Push a UART event onto the UART event queue.
int32_t cellularPortUartEventSend(const CellularPortQueueHandle_t queueHandle,
                                  int32_t sizeBytesOrError)
{
    int32_t errorCode = CELLULAR_PORT_INVALID_PARAMETER;
    CellularPortUartEventData_t uartSizeOrError;

    if (queueHandle != NULL) {
        uartSizeOrError = sizeBytesOrError;
        errorCode = cellularPortQueueSend(queueHandle, (void *) &uartSizeOrError);
    }

    return errorCode;
}

// Receive a UART event, blocking until one turns up.
int32_t cellularPortUartEventReceive(const CellularPortQueueHandle_t queueHandle)
{
    int32_t sizeOrErrorCode = CELLULAR_PORT_INVALID_PARAMETER;
    CellularPortUartEventData_t uartSizeOrError;

    if (queueHandle != NULL) {
        sizeOrErrorCode = CELLULAR_PORT_PLATFORM_ERROR;
        if (cellularPortQueueReceive(queueHandle, &uartSizeOrError) == 0) {
            sizeOrErrorCode = uartSizeOrError;
        }
    }

    return sizeOrErrorCode;
}

