u-blox/cellular/port/platform/stm/stm32f4_mynewt/src/cellular_port_uart.c
// Receive a UART event with a timeout.
int32_t cellularPortUartEventTryReceive(const CellularPortQueueHandle_t queueHandle,
                                        int32_t waitMs)
{
    int32_t sizeOrErrorCode = CELLULAR_PORT_INVALID_PARAMETER;
    CellularPortUartEventData_t uartSizeOrError;

    if (queueHandle != NULL) {
        sizeOrErrorCode = CELLULAR_PORT_TIMEOUT;
        if (cellularPortQueueTryReceive(queueHandle, waitMs, &uartSizeOrError) == 0) {
            sizeOrErrorCode = uartSizeOrError;
        }
    }

    return sizeOrErrorCode;
}

// Get the number of bytes waiting in the receive buffer.
int32_t cellularPortUartGetReceiveSize(int32_t uart)
{
    CellularPortErrorCode_t sizeOrErrorCode = CELLULAR_PORT_INVALID_PARAMETER;
    CellularPortUartData_t *pUartData = pGetUart(uart);
    const volatile char *pRxBufferWrite;

    if (pUartData != NULL) {

        CELLULAR_PORT_MUTEX_LOCK(pUartData->mutex);

        pRxBufferWrite = pUartData->pRxBufferWrite;
        sizeOrErrorCode = 0;
        if (pUartData->pRxBufferRead < pRxBufferWrite) {
            // Read pointer is behind write, bytes
            // received is simply the difference
            sizeOrErrorCode = pRxBufferWrite - pUartData->pRxBufferRead;
        } else if (pUartData->pRxBufferRead > pRxBufferWrite) {
            // Read pointer is ahead of write, bytes received
            // is from the read pointer up to the end of the buffer
            // then wrap around to the write pointer
            sizeOrErrorCode = (pUartData->pRxBufferStart +
                               CELLULAR_PORT_UART_RX_BUFFER_SIZE -
                               pUartData->pRxBufferRead) +
                              (pRxBufferWrite - pUartData->pRxBufferStart);
        }

        CELLULAR_PORT_MUTEX_UNLOCK(pUartData->mutex);

    }

    return (int32_t) sizeOrErrorCode;
}

// Read from the given UART interface.
int32_t cellularPortUartRead(int32_t uart, char *pBuffer,
                             size_t sizeBytes)
{
    CellularPortErrorCode_t sizeOrErrorCode = CELLULAR_PORT_INVALID_PARAMETER;
    size_t thisSize;
    CellularPortUartData_t *pUartData = pGetUart(uart);
    const volatile char *pRxBufferWrite;

    if (pUartData != NULL) {

        CELLULAR_PORT_MUTEX_LOCK(pUartData->mutex);

        sizeOrErrorCode = 0;
        pRxBufferWrite = pUartData->pRxBufferWrite;
        if (pUartData->pRxBufferRead < pRxBufferWrite) {
            // Read pointer is behind write, just take as much
            // of the difference as the user allows
            sizeOrErrorCode = pRxBufferWrite - pUartData->pRxBufferRead;
            if (sizeOrErrorCode > sizeBytes) {
                sizeOrErrorCode = sizeBytes;
            }
            pCellularPort_memcpy(pBuffer, pUartData->pRxBufferRead,
                                 sizeOrErrorCode);
            // Move the pointer on
            pUartData->pRxBufferRead += sizeOrErrorCode;
        } else if (pUartData->pRxBufferRead > pRxBufferWrite) {
            // Read pointer is ahead of write, first take up to the
            // end of the buffer as far as the user allows
            thisSize = pUartData->pRxBufferStart +
                       CELLULAR_PORT_UART_RX_BUFFER_SIZE -
                       pUartData->pRxBufferRead;
            if (thisSize > sizeBytes) {
                thisSize = sizeBytes;
            }
            pCellularPort_memcpy(pBuffer, pUartData->pRxBufferRead,
                                 thisSize);
            pBuffer += thisSize;
            sizeBytes -= thisSize;
            sizeOrErrorCode = thisSize;
            // Move the read pointer on, wrapping as necessary
            pUartData->pRxBufferRead += thisSize;
            if (pUartData->pRxBufferRead >= pUartData->pRxBufferStart +
                                            CELLULAR_PORT_UART_RX_BUFFER_SIZE) {
                pUartData->pRxBufferRead = pUartData->pRxBufferStart;
            }
            // If there is still room in the user buffer then
            // carry on taking up to the write pointer
            if (sizeBytes > 0) {
                thisSize = pRxBufferWrite - pUartData->pRxBufferRead;
                if (thisSize > sizeBytes) {
                    thisSize = sizeBytes;
                }
                pCellularPort_memcpy(pBuffer, pUartData->pRxBufferRead,
                                     thisSize);
                pBuffer += thisSize;
                sizeBytes -= thisSize;
                sizeOrErrorCode += thisSize;
                // Move the read pointer on
                pUartData->pRxBufferRead += thisSize;
            }
        }

        // If everything has been read, a notification
        // is needed for the next one
        if (pUartData->pRxBufferRead == pRxBufferWrite) {
            pUartData->userNeedsNotify = true;
        }

        CELLULAR_PORT_MUTEX_UNLOCK(pUartData->mutex);

    }

    return (int32_t) sizeOrErrorCode;
}

// Write to the given UART interface.
int32_t cellularPortUartWrite(int32_t uart,
                              const char *pBuffer,
                              size_t sizeBytes)
{
    CellularPortErrorCode_t sizeOrErrorCode = CELLULAR_PORT_INVALID_PARAMETER;
    CellularPortUartData_t *pUartData = pGetUart(uart);
    USART_TypeDef *pReg;

    if (pUartData != NULL) {

        CELLULAR_PORT_MUTEX_LOCK(pUartData->mutex);

        pReg = gUartCfg[uart].pReg;
        sizeOrErrorCode = sizeBytes;

        // Do the blocking send
        while (sizeBytes > 0) {
            LL_USART_TransmitData8(pReg, (uint8_t) *pBuffer);
            while (!LL_USART_IsActiveFlag_TXE(pReg)) {}
            pBuffer++;
            sizeBytes--;
        }
        while (!LL_USART_IsActiveFlag_TC(pReg)) {}

        CELLULAR_PORT_MUTEX_UNLOCK(pUartData->mutex);

    }

    return (int32_t) sizeOrErrorCode;
}

// Determine if RTS flow control is enabled.
bool cellularPortIsRtsFlowControlEnabled(int32_t uart)
{
    CellularPortUartData_t *pUartData = pGetUart(uart);
    bool rtsFlowControlIsEnabled = false;
    uint32_t flowControlStatus;

    if (pUartData != NULL) {
        // No need to lock the mutex, this is atomic
        flowControlStatus = LL_USART_GetHWFlowCtrl(gUartCfg[uart].pReg);
        if ((flowControlStatus == LL_USART_HWCONTROL_RTS) ||
            (flowControlStatus == LL_USART_HWCONTROL_RTS_CTS)) {
            rtsFlowControlIsEnabled = true;
        }
    }

    return rtsFlowControlIsEnabled;
}

// Determine if CTS flow control is enabled.
bool cellularPortIsCtsFlowControlEnabled(int32_t uart)
{
    CellularPortUartData_t *pUartData = pGetUart(uart);
    bool ctsFlowControlIsEnabled = false;
    uint32_t flowControlStatus;

    if (pUartData != NULL) {
        // No need to lock the mutex, this is atomic
        flowControlStatus = LL_USART_GetHWFlowCtrl(gUartCfg[uart].pReg);
        if ((flowControlStatus == LL_USART_HWCONTROL_CTS) ||
            (flowControlStatus == LL_USART_HWCONTROL_RTS_CTS)) {
            ctsFlowControlIsEnabled = true;
        }
    }

    return ctsFlowControlIsEnabled;
}

// End of filed
